dooraim/STM32_Discovery/LIS3DSH_STM32F_Discovery.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Group 19. Casado Perez Alejandro, Del Prado Buznego Paula, Gañan Onieva Francisco Javier, Orlando Nico
  * @version V8.0
  * @date    8-June-2020
  * @brief   Final Project
  ******************************************************************************
*/

/*********** Includes  ****************/
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"
#include "stm32f4_discovery_lis3dsh.h"
#include "math.h" //we include the <math.h> library to use atan2 and M_PI
#include <stdio.h>

#include "arm_math.h"
#include "math_helper.h"
#include "noarm_cmsis.h"

/*********** Defines   ****************/
#define DATA_STREAM_PERIOD_MS 200  //We stream data streaming through the UART at 5Hz
#define RESULT_STREAM_PERIOD_MS 50 //We stream result streaming through the UART at 20Hz
#define ACCEL_PERIOD_MS 10		   //save the data coming from the accelerometer at 100 Hz

/* ----------------------------------------------------------------------
* Defines for each of the tests performed
* ------------------------------------------------------------------- */
#define BLOCK_SIZE 5			  //The smaller amount of data we are going to filter is 100Hz read / 20 Hz transmitted
#define NUM_TAPS 10				  //we are going to use 10 coeffs in the filter
#define sampleWindow 5			  //when we do the mean, we do it of a sample window of 5, as specified in the problem
#define Data_Filtering_Amount 20  //sampling acc at 100Hz and streaming at 5Hz, we get 20 values from acc
#define Result_Filtering_Amount 5 //sampling acc at 100Hz and streaming at 20Hz, we get 5 values from acc

/*********** Declarations *************/
/*------ Function prototypes ---------*/
void USART_Config(void);
void Acc_Config(void);
float Calculate_Roll(float32_t X_axis, float32_t Z_axis);
float Calculate_Pitch(float32_t X_axis, float32_t Y_axis, float32_t Z_axis);
float Mean_sampleWindow(float32_t Data_Vector[], int i);
void ledOrientation(float X, float Y, float Z);
void print_easter_egg(void);
/*------ Global variables  -----------*/
u8 streamActive = 0; //Variable to start/stop the streaming of data {'0' Do not Stream || '1' Stream Data}

typedef enum
{ //structure to difference Data from Result streaming
	Streaming_Data,
	Streaming_Result
} Type_of_Streaming_TypeDef;

Type_of_Streaming_TypeDef Type_of_Streaming = Streaming_Data;

u8 Stream_Ready = 0;   //variable to indicate we can start streaming {'1' stream, '0' don't stream}
u8 dataReceived = 0;   //Variable to indicate we can stream through UART, put to 1 by systick each 200 ms
u8 chRX = 0;		   //Variable to save the character introduced by UART (Key from the computer in our case)
u8 Data_Acc_Ready = 0; //Variable to indicate that we can read the data from the Accelerometer, put to 1 by systick every 10 ms

/* -------------------------------------------------------------------
 * Declare State buffer of size (numTaps + blockSize - 1), one for each axis
 * ------------------------------------------------------------------- */

static float32_t firStateF32X[BLOCK_SIZE + NUM_TAPS - 1];
static float32_t firStateF32Y[BLOCK_SIZE + NUM_TAPS - 1];
static float32_t firStateF32Z[BLOCK_SIZE + NUM_TAPS - 1];

/* ----------------------------------------------------------------------
 ** FIR Coefficients buffer generated using fir1() MATLAB function.
 **
 **
 ** %Define sampling frequency
 ** Fs=100; %100Hz
 ** %Define cutoff frequency
 ** Cutoff_freq=5;
 ** %Calculate Nyquist frequency
 ** Nyq_frequency=Fs/2;
 ** Cutoff_norm=Cutoff_freq/Nyq_frequency;
 ** %FIR order
 ** order=9;            %x^9-x^0
 ** %calculate taps (coefficients)
 ** FIR_coeff=fir1(order,Cutoff_norm);
 **
 ** ------------------------------------------------------------------- */

const float32_t firCoeffs32[NUM_TAPS] = {
	+0.01198f, +0.03259f, +0.08880f, +0.15903f,
	+0.20758f, +0.20758f, +0.15903f, +0.08880f,
	+0.03259f, +0.01198f};

/* ----------------------------------------------------------------------
* Declare Global variables
* ------------------------------------------------------------------- */

uint32_t blockSize = BLOCK_SIZE; //variable in uint32_t of the Block size

/***********   Main  ******************/
int main(void)
{

	int i, k = 0;																		//variables that will act as counters for loops
	arm_fir_instance_f32 Fir_Instance_X_Axis, Fir_Instance_Y_Axis, Fir_Instance_Z_Axis; //instances of the filter
	int BUFFER_ACC_AXIS = Data_Filtering_Amount;										//the maximum amount of data obtained from the accumulator before we read it, by default we start streaming Data
	uint32_t numBlocks = BUFFER_ACC_AXIS / blockSize;									//number of blocks of data we need to filter, it will be 4 for Data streaming, 1 for Result streaming
	int16_t Data_Read_Acc[3] = {0, 0, 0};												//Auxiliary variable for the temporal data read from the accelerometer each 10ms

	/* -------------------------------------------------------------------
	 Vectors that will act as buffers storing the data read from the accelerometer before and after passing the filter
	 * ------------------------------------------------------------------- */
	float32_t Data_Stored_X_axis[BUFFER_ACC_AXIS];
	float32_t Data_Stored_Y_axis[BUFFER_ACC_AXIS];
	float32_t Data_Stored_Z_axis[BUFFER_ACC_AXIS];
	float32_t Data_Stored_Filtered_X_axis[BUFFER_ACC_AXIS];
	float32_t Data_Stored_Filtered_Y_axis[BUFFER_ACC_AXIS];
	float32_t Data_Stored_Filtered_Z_axis[BUFFER_ACC_AXIS];

	/* -------------------------------------------------------------------
	 Variables that will store the planar and orientation data of the board
	 * ------------------------------------------------------------------- */
	float Orientation_X_Axis;
	float Orientation_Y_Axis;
	float Orientation_Z_Axis;
	float roll = 0;
	float pitch = 0;

	// LED initialization
	STM_EVAL_LEDInit(LED3); // Orange
	STM_EVAL_LEDInit(LED4); // Green
	STM_EVAL_LEDInit(LED5); // Red
	STM_EVAL_LEDInit(LED6); // Blue

	/* USART configuration */
	USART_Config();

	/* Accelerometer configuration */
	Acc_Config();

