dooraim/STM32_Discovery/LIS3DSH_STM32F_Discovery.c
	/* SysTick configuration */
	if (SysTick_Config(SystemCoreClock / 1000))
	{
		/* Capture error */
		while (1)
			;
	}

	/* Call FIR init function to initialize the instance structure of each axis. */
	arm_fir_init_f32(&Fir_Instance_X_Axis, NUM_TAPS, (float32_t *)&firCoeffs32[0], &firStateF32X[0], blockSize);
	arm_fir_init_f32(&Fir_Instance_Y_Axis, NUM_TAPS, (float32_t *)&firCoeffs32[0], &firStateF32Y[0], blockSize);
	arm_fir_init_f32(&Fir_Instance_Z_Axis, NUM_TAPS, (float32_t *)&firCoeffs32[0], &firStateF32Z[0], blockSize);

	/* turn on green led, to indicate everything is initialized, until we get an user input */
	STM_EVAL_LEDOn(LED4);

	while (1)
	{

		if (dataReceived == 1)
		{
			/*
						 * By pressing the "s" button I start streaming the data, instead by pressing the "d" button I
						 * decide whether to print the mean of planar data or the results of the calculation on the "pitch" and "roll"
						 * By pressing "h" we get an easter egg
						 */
			if (chRX == 's')
			{
				streamActive = 1 - streamActive; //we toggle the streaming
				printf("Stream Toggle\r\n");
				STM_EVAL_LEDOff(LED4);
				if (streamActive == 0) //if we turn off the streaming we turn off all leds
				{
					STM_EVAL_LEDOff(LED3);
					STM_EVAL_LEDOff(LED4);
					STM_EVAL_LEDOff(LED5);
					STM_EVAL_LEDOff(LED6);
				}
			}
			else
			{
				if (chRX == 'd')
				{
					Type_of_Streaming = !Type_of_Streaming; //we change the type of streaming
					printf("Result or Data Toggle\r\n");
					if (Type_of_Streaming == Streaming_Result)
					{
						printf("\nNow streaming Result\r\n");
						BUFFER_ACC_AXIS = Result_Filtering_Amount; //we change the amount of Data processed
					}
					else
					{
						printf("\nNow streaming Data\r\n");
						BUFFER_ACC_AXIS = Data_Filtering_Amount; //we change the amount of Data processed
					}
					numBlocks = BUFFER_ACC_AXIS / blockSize; //we update the number of blocks to be processed
				}
				else if (chRX == 'h')
					print_easter_egg();
				else
				{
					printf("Wrong command\r\n");
				}
			}
			dataReceived = 0; //we acknowledge that the data received has been processed, and start waiting for a new one
		}

		if (streamActive == 1)
		{
			if (Stream_Ready == 1)
			{
				/*
				 * Call the FIR process function for every blockSize samples  of each axis
				 * and evaluate the media of the sampleWindow elements filtered, storing it in The planar data variables
				 */

				for (i = 0; i < numBlocks; i++)
				{
					arm_fir_f32(&Fir_Instance_X_Axis, &Data_Stored_X_axis[i * blockSize], &Data_Stored_Filtered_X_axis[i * blockSize], blockSize);
					arm_fir_f32(&Fir_Instance_Y_Axis, &Data_Stored_Y_axis[i * blockSize], &Data_Stored_Filtered_Y_axis[i * blockSize], blockSize);
					arm_fir_f32(&Fir_Instance_Z_Axis, &Data_Stored_Z_axis[i * blockSize], &Data_Stored_Filtered_Z_axis[i * blockSize], blockSize);
					Orientation_X_Axis = Mean_sampleWindow(Data_Stored_Filtered_X_axis, i * blockSize);
					Orientation_Y_Axis = Mean_sampleWindow(Data_Stored_Filtered_Y_axis, i * blockSize);
					Orientation_Z_Axis = Mean_sampleWindow(Data_Stored_Filtered_Z_axis, i * blockSize);
					//if we first start streaming result, the first value streamed will be smaller as, the filter needs 10 values to have a complete output, and we just have 5
				}

				//calculate the "roll"
				roll = Calculate_Roll(Orientation_X_Axis, Orientation_Z_Axis);

				//calculate the "pitch"
				pitch = Calculate_Pitch(Orientation_X_Axis, Orientation_Y_Axis, Orientation_Z_Axis);

				if (Type_of_Streaming == Streaming_Data)
				{

					//Print data, every 5 Hz
					printf("X: %4d[mg]\t Y: %4d[mg]\t Z: %4d[mg]\r\n", (int)Orientation_X_Axis, (int)Orientation_Y_Axis, (int)Orientation_Z_Axis);
				}

				if (Type_of_Streaming == Streaming_Result)
				{

					//Print result for Roll and pitch, every 20 Hz
					printf("roll: %4d[degrees]\t pitch: %4d[degrees]\r\n", (int)roll, (int)pitch);
				}

				ledOrientation(Orientation_X_Axis, Orientation_Y_Axis, Orientation_Z_Axis); //we turn the led oriented to ground on
				Stream_Ready = 0;															//we acknowledge that the data has been streamed
			}

			if (Data_Acc_Ready == 1) //if a data to read from the accumulator is ready
			{
				LIS3DSH_ReadACC(Data_Read_Acc);						 //we save the values we read form the accumulator in Temp_Data, this function saves them in [mg]
				Data_Stored_X_axis[k] = (float32_t)Data_Read_Acc[0]; //we store the data in a vector that acts as a buffer
				Data_Stored_Y_axis[k] = (float32_t)Data_Read_Acc[1];
				Data_Stored_Z_axis[k] = (float32_t)Data_Read_Acc[2];
				k++;					  //increment the counter so values are not overwritten
				if (k >= BUFFER_ACC_AXIS) //if we get to the amount of data we are able to save in the time window before the filter requests it, we can start writing new data as the filter will have already read it
					k = 0;
				Data_Acc_Ready = 0; //we acknowledge the data from the acc has been stored
			}
		}
	}
}

/*********** Functions   ****************/

void USART_Config(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	/* Enable GPIO clock */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	/* Enable UART clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

	/* Connect PXx to USARTx_Tx*/
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);

	/* Connect PXx to USARTx_Rx*/
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);

	/* Configure USART Tx as alternate function  */
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure USART Rx as alternate function  */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure the USART2 Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x01;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the RX Interrupt */
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);

	/* USARTx configured as follows:
		- BaudRate = 115200 baud
		- Word Length = 8 Bits
		- One Stop Bit
		- No parity
		- Hardware flow control disabled (RTS and CTS signals)
		- Receive and transmit enabled
	*/
	USART_InitStructure.USART_BaudRate = 115200;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

