dooraim/STM32_Discovery/LIS3DSH_STM32F_Discovery.c
	/* USART initialization */
	USART_Init(USART2, &USART_InitStructure);

	/* Enable USART */
	USART_Cmd(USART2, ENABLE);
}

/**
  * @brief  This function initializes the SPI and the LIS3DSH Accelerometer.
  * @param  None
  * @retval None
  */
void Acc_Config(void)
{
	LIS3DSH_InitTypeDef AccInitStruct;

	AccInitStruct.Output_DataRate = LIS3DSH_DATARATE_100; //we introduce a sample period of 100Hz
	AccInitStruct.Axes_Enable = LIS3DSH_XYZ_ENABLE;		  //enable read from the 3 axes
	AccInitStruct.SPI_Wire = LIS3DSH_SERIALINTERFACE_4WIRE;
	AccInitStruct.Self_Test = LIS3DSH_SELFTEST_NORMAL;
	AccInitStruct.Full_Scale = LIS3DSH_FULLSCALE_2; // range +-2g
	AccInitStruct.Filter_BW = LIS3DSH_FILTER_BW_800;
	/*
					 * We decided to keep this filter as it will let us have a more clear output
					 * anyway if we couldn't use it, without it we have seen that the read values have an approximate offset of
					 * (X=-180 Y=-200 Z=510), that we would have to subtract to each axis of the data read from the accelerometer
					 * as we can leave it, and with 2 filters the values obtained have less noise we decided to keep it
					 */

	LIS3DSH_Init(&AccInitStruct);
}

/*********** IRQ Handlers   ****************/

void SysTick_Handler(void) //SysTick defined to execute once every ms
{
	static int counterStream_ms = 0; //counter for the streaming period
	static int counterAcc_ms = 0;	 //counter for the accumulator read period

	if (streamActive == 1) //if we are sending data
	{
		counterStream_ms++; //we increment the counters
		counterAcc_ms++;

		if (counterStream_ms >= DATA_STREAM_PERIOD_MS && Type_of_Streaming == Streaming_Data) //if we are streaming Data, we count until DATA_STREAM_PERIOD_MS
		{
			Stream_Ready = 1;	  //we indicate we can Stream Data or Result
			counterStream_ms = 0; //we reset the counter
		}
		if (counterStream_ms >= RESULT_STREAM_PERIOD_MS && Type_of_Streaming == Streaming_Result) //if we are streaming Result, we count until RESULT_STREAM_PERIOD_MS
		{
			Stream_Ready = 1;	  //we indicate we can Stream Data or Result
			counterStream_ms = 0; //we reset the counter
		}

		if (counterAcc_ms >= ACCEL_PERIOD_MS) //We will save the data from the Accelerometer when the counter is >= ACCEL_PERIOD_MS
		{
			Data_Acc_Ready = 1; //we indicate we can start reading the data from the accelerometer
			counterAcc_ms = 0;	//we reset the counter
		}
	}
}

void USART2_IRQHandler(void)
{
	/* RX interrupt */
	if (USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)
	{
		chRX = USART_ReceiveData(USART2); //we save the read character in chRX
		dataReceived = 1;				  //we indicate we have received a character
	}
}

/*********** Functions Definition ****************/

/**
  * @brief  This function retargets the C library printf function to the USART.
  * @param  None
  * @retval None
  */
int __io_putchar(int ch)
{
	/* Place your implementation of fputc here */
	/* e.g. write a character to the USART */
	USART_SendData(USART2, (uint8_t)ch);

	/* Loop until the end of transmission */
	while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)
	{
	}

	return ch;
}

/**
  * @brief  This function is used to calculate the "roll" parameter
  * @param  float32_t Data_Stored_Filtered_A_axis, float32_t Data_Stored_Filtered_B_axis
  * @retval Value of the "roll" parameter for the two axes in degrees
  */
float Calculate_Roll(float32_t X_axis, float32_t Z_axis)
{
	return (atan2(-X_axis, Z_axis)) * 180 / M_PI;
}

/**
  * @brief  This function is used to calculate the "pitch" parameter
  * for the pitch, as we can just get a value of the range [-90,90], by knowing the planar orientation signs,
  * we can made some changes so that it covers the whole range [-180,180]
  *
  * @param  float32_t Data_Stored_Filtered_A_axis, float32_t Data_Stored_Filtered_B_axis, float32_t Data_Stored_Filtered_C_axis
  * @retval Value of the "pitch" parameter in degrees
  */
float Calculate_Pitch(float32_t X_axis, float32_t Y_axis, float32_t Z_axis)
{
	float value = (atan2(Y_axis, sqrt(pow(X_axis, 2) + pow(Z_axis, 2)))) * 180 / M_PI;
	if (Z_axis > 0)
		return value;	//if we are inside[-90,90] we don't need to change anything
	else if (value > 0) //we do the relevant change, as the increment of angle comes from -Y axis, we change the orientation, and add 180 to get the correct angle
		return 180 - value;
	else //we do the relevant change, as the decrement of angle comes from -Y axis, we change the orientation, and subtract 180 to get the correct angle
		return (-value - 180);
}

/**
  * @brief  This function is used to calculate the mean of the [i, i + sampleWindow] components of a vector.
  * @param  float32_t Data_Vector[]
  * @retval MediaAccumulation/sampleWindow
  */
float Mean_sampleWindow(float32_t Data_Vector[], int i)
{
	float MediaAccumulation = 0;
	int k;
	for (k = i; k < i + sampleWindow; k++)
		MediaAccumulation += Data_Vector[i];
	return MediaAccumulation / sampleWindow;
}

/**
  * @brief  This function takes the value of the pitches, previously calculated, and according to their sign, turns on only the LED that points towards the ground.
  * @param  float X, float  Y , float  Z
  * @retval No data, but turns on the led pointing towards the ground
  */
void ledOrientation(float X, float Y, float Z)
{

	//button blue ground
	if (X < 0 && X < Y && X < -Y)
	{						   //if X is negative and it's absolute value is higher than the absolute value of Y, that means the ground is in the direction of the green led
		STM_EVAL_LEDOff(LED3); // Orange
		STM_EVAL_LEDOn(LED4);  // Green
		STM_EVAL_LEDOff(LED5); // Red
		STM_EVAL_LEDOff(LED6); // Blue
	}
	//usb ground
	if (Y > 0 && Y > X && Y > -X)
	{						   //if Y is positive and higher than the absolute value of X, that means the ground is in the direction of the orange led
		STM_EVAL_LEDOn(LED3);  // Orange
		STM_EVAL_LEDOff(LED4); // Green
		STM_EVAL_LEDOff(LED5); // Red
		STM_EVAL_LEDOff(LED6); // Blue
	}
	//button black ground
	if (X > 0 && X > Y && X > -Y)
	{						   //if X is positive and higher than the absolute value of Y, that means the ground is in the direction of the red led
		STM_EVAL_LEDOff(LED3); // Orange
		STM_EVAL_LEDOff(LED4); // Green
		STM_EVAL_LEDOn(LED5);  // Red
		STM_EVAL_LEDOff(LED6); // Blue
	}
	//jack ground
	if (Y < 0 && Y < X && Y < -X)
	{						   //if Y is positive and its absolute value is higher than the absolute value of X, that means the ground is in the direction of the blue led
		STM_EVAL_LEDOff(LED3); // Orange
		STM_EVAL_LEDOff(LED4); // Green
		STM_EVAL_LEDOff(LED5); // Red
		STM_EVAL_LEDOn(LED6);  // Blue
	}
}

