dooraim/STM32_Discovery/LIS3DSH_STM32F_Discovery.c
void print_easter_egg(void)
{ //function that prints the easter egg

	printf("                            ,ooo888888888888888oooo,\r\n");
	printf("                          o8888YYYYYY77iiiiooo8888888o\r\n");
	printf("                         8888YYYY77iiYY8888888888888888\r\n");
	printf("                        [88YYY77iiY88888888888888888888]\r\n");
	printf("                        88YY7iYY888888888888888888888888\r\n");
	printf("                       [88YYi 88888888888888888888888888]\r\n");
	printf("                       i88Yo8888888888888888888888888888i\r\n");
	printf("                       i]        ^^^88888888^^^     o  [i\r\n");
	printf("                      oi8  i           o8o          i  8io\r\n");
	printf("                    ,77788o ^^  ,oooo8888888ooo,   ^ o88777,\r\n");
	printf("                    7777788888888888888888888888888888877777\r\n");
	printf("                     77777888888888888888888888888888877777\r\n");
	printf("                      77777788888888^7777777^8888888777777\r\n");
	printf("       ,oooo888 ooo   88888778888^7777ooooo7777^8887788888        ,o88^^^^888oo\r\n");
	printf("    o8888777788[];78 88888888888888888888888888888888888887 7;8^ 888888888oo^88\r\n");
	printf("   o888888iii788 ]; o 78888887788788888^;;^888878877888887 o7;[]88888888888888o\r\n");
	printf("   88888877 ii78[]8;7o 7888878^ ^8788^;;;;;;^878^ ^878877 o7;8 ]878888888888888\r\n");
	printf("  [88888888887888 87;7oo 777888o8888^;ii;;ii;^888o87777 oo7;7[]8778888888888888\r\n");
	printf("  88888888888888[]87;777oooooooooooooo888888oooooooooooo77;78]88877i78888888888\r\n");
	printf(" o88888888888888 877;7877788777iiiiiii;;;;;iiiiiiiii77877i;78] 88877i;788888888\r\n");
	printf(" 88^;iiii^88888 o87;78888888888888888888888888888888888887;778] 88877ii;7788888\r\n");
	printf(";;;iiiii7iiii^  87;;888888888888888888888888888888888888887;778] 888777ii;78888\r\n");
	printf(";iiiii7iiiii7iiii77;i88888888888888888888i7888888888888888877;77i 888877777ii78\r\n");
	printf("iiiiiiiiiii7iiii7iii;;;i7778888888888888ii7788888888888777i;;;;iiii 88888888888\r\n");
	printf("i;iiiiiiiiiiii7iiiiiiiiiiiiiiiiiiiiiiiiii8877iiiiiiiiiiiiiiiiiii877   88888\r\n");
	printf("ii;;iiiiiiiiiiiiii;;;ii^^^;;;ii77777788888888888887777iii;;  77777           78\r\n");
	printf("^ii;8iiiiiiii ';;;;ii;;;;;;;;;;;;;;;;;;^^oo ooooo^^^88888888;;i7          7;788\r\n");
	printf("o ^;;^^88888^     'i;;;;;;;;;;;;;;;;;;;;;;;;;;;^^^88oo^^^^888ii7         7;i788\r\n");
	printf("88ooooooooo         ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 788oo^;;          7;i888\r\n");
	printf("887ii8788888      ;;;;;;;ii;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;^87           7;788\r\n");
	printf("887i8788888^     ;;;;;;;ii;;;;;;;oo;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;,,,      ;;888\r\n");
	printf("87787888888     ;;;;;;;ii;;;;;;;888888oo;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;,,;i788\r\n");
	printf("87i8788888^       ';;;ii;;;;;;;8888878777ii8ooo;;;;;;;;;;;;;;;;;;;;;;;;;;i788 7\r\n");
	printf("77i8788888           ioo;;;;;;oo^^ooooo ^7i88^ooooo;;;;;;;;;;;;;;;;;;;;i7888 78\r\n");
	printf("7i87788888o         7;ii788887i7;7;788888ooooo7888888ooo;;;;;;;;;;;;;;oo ^^^ 78\r\n");
	printf("i; 7888888^      8888^o;ii778877;7;7888887;;7;7788878;878;;    ;;;;;;;i78888o ^\r\n");
	printf("i8 788888       [88888^^ ooo ^^^^^;;77888^^^^;;7787^^^^ ^^;;;;  iiii;i78888888\r\n");
	printf("^8 7888^        [87888 87 ^877i;i8ooooooo8778oooooo888877ii; iiiiiiii788888888\r\n");
	printf("  ^^^          [7i888 87;; ^8i;;i7888888888888888887888888   i7iiiiiii88888^^\r\n");
	printf("               87;88 o87;;;;o 87i;;;78888788888888888888^^ o 8ii7iiiiii;;\r\n");
	printf("               87;i8 877;77888o ^877;;;i7888888888888^^ 7888 78iii7iii7iiii\r\n");
	printf("               ^87; 877;778888887o 877;;88888888888^ 7ii7888 788oiiiiiiiii\r\n");
	printf("                 ^ 877;7 7888888887 877i;;8888887ii 87i78888 7888888888\r\n");
	printf("                  [87;;7 78888888887 87i;;888887i  87ii78888 7888888888]\r\n");
	printf("                  877;7 7788888888887 887i;887i^  87ii788888 78888888888\r\n");
	printf("                  87;i8 788888888888887 887ii;;^ 87ii7888888 78888888888\r\n");
	printf("                 [87;i8 7888888888888887 ^^^^   87ii77888888 78888888888\r\n");
	printf("                 87;;78 7888888888888887ii      87i78888888 778888888888\r\n");
	printf("                 87;788 7888888888888887i]      87i78888888 788888888888\r\n");
	printf("                87;;88 78888888888888887]       ii778888888 78888888888]\r\n");
	printf("                7;;788 7888888888888888]        i7888888888 78888888888'\r\n");
	printf("                7;;788 7888888888888888         'i788888888 78888888888\r\n");
	printf("                7;i788 788888888888888]          788888888 77888888888]\r\n");
	printf("                '7;788 778888888888888]         [788888888 78888888888'\r\n");
	printf("                ';77888 78888888888888          8888888888 7888888888]\r\n");
	printf("                 778888 78888888888888          8888888888 7888888888]\r\n");
	printf("                  78888 7888888888888]         [8888888888 7888888888\r\n");
	printf("                   7888 788888888888]          88888888888 788888888]\r\n");
	printf("                    778 78888888888]           ]888888888 778888888]\r\n");
	printf("                    oooooo ^88888^              ^88888^^^^^^^^8888]\r\n");
	printf("                   [877;i77888888888]          [;78887i8888878i7888;\r\n");
	printf("                    ^877;;ii7888ii788          ;i777;7788887787;778;\r\n");
	printf("                     ^87777;;;iiii777          ;77^^^^^^^^^^^^^^^^;;\r\n");
	printf("                        ^^^^^^^^^ii7]           ^ o88888888877iiioo\r\n");
	printf("                           77777o               [88777777iiiiii;;778\r\n");
	printf("                            77777iii            8877iiiii;;;77888888]\r\n");
	printf("                            77iiii;8           [77ii;778 788888888888\r\n");
	printf("                            7iii;;88           iii;78888 778888888888\r\n");
	printf("                           77i;78888]          ;;;;i88888 78888888888\r\n");
	printf("                          i;788888888           ;i7888888 7888888888\r\n");
	printf("                          ;788888888]           i77888888 788888888]\r\n");
	printf("                          ';88888888'           [77888888 788888888]\r\n");
	printf("                           [[8ooo88]             78888888 788888888\r\n");
	printf("                            [88888]              78888888 788888888\r\n");
	printf("                              ^^^                [7888888 77888888]\r\n");
	printf("                                                  88888888 7888887\r\n");
	printf("                                                  77888888 7888887\r\n");
	printf("                                                   ;i88888 788888i\r\n");
	printf("                                                  ,;;78888 788877i7\r\n");
	printf("                                                 ,7;;i;777777i7i;;7\r\n");
	printf("                                                 87778^^^ ^^^^87778\r\n");
	printf("                                                  ^^^^ o777777o ^^^\r\n");
	printf("                                                  o77777iiiiii7777o\r\n");
	printf("                                                 7777iiii88888iii777\r\n");
	printf("                                                ;;;i7778888888877ii;;\r\n");
	printf("                   Imperial Stormtrooper       [i77888888^^^^8888877i]\r\n");
	printf("                  (Standard Shock Trooper)     77888^oooo8888oooo^8887]\r\n");
	printf("                                              [788888888888888888888888]\r\n");
	printf("                                              88888888888888888888888888\r\n");
	printf("                                              ]8888888^iiiiiiiii^888888]\r\n");
	printf("                       Bob VanderClay           iiiiiiiiiiiiiiiiiiiiii\r\n");
	printf("                                                    ^^^^^^^^^^^^^\r\n");
}
